#include <iostream>
#include <iomanip>
#include <string>
#include <sstream>

using namespace std;

int main()
{
    setlocale(LC_ALL, "Ru");

    //Задание 1
    //string s, al = "1234567890";

    //getline(cin,s);

    //int i = 0, j = 0, t = 0;
    //float k1 = 0, k2 = 0, k3 = 0, a[100], b[100];

    //for (auto c : s) {//Заполняем массив с нулями и без, а так же считаем суммы элементов и их кол-во.
    //    if (al.find(c) != -1) {
    //        k1 += int(c) - '0';
    //        if (c != '0') {
    //            b[i] = int(c) - '0';
    //            k3 += b[i];//Считаем сумму элементов второго массива.
    //            a[j] = int(c) - '0';
    //            i++;
    //        }
    //        else if (c == '0') {
    //            a[j] = int(c) - '0';
    //        }
    //        j++;
    //    }
    //}

    //k1 = k1 / j;//Среднее элементов изначального массива.

    //for (t = 0; t < j; t++) {//Заменяем нули на среднее значение.
    //    if (a[t] == 0) {
    //        a[t] = k1;
    //    }
    //    k2 += a[t];
    //}

    //k2 = k2 / j;//Среднее элементов изменённого массива.
    //
    //k3 = k3 / i;//Среднее элементов второго массива.

    //cout <<"ср. значение a: " << k2 << ' ' << "ср. значение b: " << k3 << '\n';//Вывод результатов.
    //if (k2 > k3) {
    //    cout << "среднее значение элементов массива a больше";
    //}
    //else {
    //    cout << "среднее значение элементов массива b больше";
    //}

    //Задание 2
    //string al1 = " ,.;:)!?}]'", al2 = " ({['";
    //char str[80], word[80];
    //int i, j, k = 0, t = 0, l1 = 0, l2 = 0;
    //cout << "Введите текст: ";
    //gets_s(str);
    //cout << "Введите слово: ";
    //gets_s(word);
    //for (i = 0; word[i]; i++) {//Узнаем размер слова.
    //    l1++;
    //}
    //for (i = 0; str[i]; i++) {//Узнаем размер текста.
    //    l2++;
    //}
    //for (i = 0; str[i]; i++) {//посимвольно перебираем по тексту.
    //    for (j = 0; word[j]; j++) {
    //        if (str[i + j] == word[j]) {
    //            k++;
    //        }
    //        else {
    //            break;
    //        }
    //    }
    //    if (k == l1) {//критерии.
    //        if (i != 0 and i + l1 != l2) {
    //            if (al2.find(str[i - 1]) != -1 and al1.find(str[i + l1]) != -1) {
    //                t++;
    //                k = 0;
    //            }
    //        }
    //        else if (i == 0 and i + l1 != l2) {
    //             if (al1.find(str[i + l1]) != -1) {
    //                 t++;
    //                 k = 0;
    //            }
    //        }
    //        else if (i + l1 == l2 and i != 0) {
    //            if (al2.find(str[i - 1]) != -1) {
    //                t++;
    //                k = 0;
    //            }
    //        }
    //        else if (i + l1 == l2 and i == 0) {
    //                t++;
    //                k = 0;
    //            
    //        }
    //    }
    //    k = 0;
    //}
    //cout << t;


    return 0;
}
